<x-app-layout>
    <x-slot name="header">
        <h2 class="font-semibold text-xl text-gray-800 dark:text-gray-200 leading-tight">
        </h2>
    </x-slot>


    <div class="messenger">
        <div class="messenger_dialogs">

            <div class="message_dialog_searh">

                <p class="txt2">Мессенджер</p>

                <div class="search-container">
                    <input type="text" id="" class="custom-search-input-news" placeholder="Поиск по имени...">
                </div>

            </div>

            <div class="message_dialogs">

                <div class="message_dialog">

                    <div class="author">
                        <div class="avatar_mini"></div>
                        <p class="txt2"></p>
                    </div>

                    <div class="message_dialog_last">
                        <p class="txt1"></p>
                    </div>


                </div>


            </div>

            <div class="message_dialogs">

                <div class="message_dialog">

                    <div class="author">
                        <div class="avatar_mini"></div>
                        <p class="txt2"></p>
                    </div>

                    <div class="message_dialog_last">
                        <p class="txt1"></p>
                    </div>


                </div>


            </div>

            <div class="message_dialogs">

                <div class="message_dialog">

                    <div class="author">
                        <div class="avatar_mini"></div>
                        <p class="txt2"></p>
                    </div>

                    <div class="message_dialog_last">
                        <p class="txt1"></p>
                    </div>


                </div>


            </div>

        </div>

        <div class="message_history">

            <div class="message_history_author_background">

                <div class="message_history_author_info">

                    <div class="message_history_author_info_img"></div>

                    <div class="message_history_author_info_name">
                        <p>LOGIN</p>

                        <div class="message_history_author_info_online">
                            <p>В сети...</p>
                        </div>

                    </div>

                </div>

                <div class="message_history_author_buttons">

                    <button class="novost_down_func_video" type="submit">?</button>
                    <button class="novost_down_func_video" type="submit">?</button>

                </div>

            </div>

            <div class="message_history_dialog">


                <div class="message_history_dialog_field">
                    <div class="message_history_field">

                        {{-- @foreach ($messages as $message)
                            @if ($message->sender_id === auth()->id()) --}}


                        <!-- Сообщения отправителя -->
                        <div class="message_history_dialog_field_right">

                            <div style="width:40%">
                                <p class="txt_2">{{ auth()->user()->name }}</p>

                                <div class="message_history_dialog_field_right_rama">
                                    <div class="message_history_dialog_field_right_content">

                                        <div class="txt_2">
                                            КонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтент
                                        </div>
                                    </div>
                                </div>
                            </div>

                        </div>


                        {{-- @else --}}


                        <!-- Сообщения получателя -->
                        <div class="message_history_dialog_field_left">
                            <div>


                                <p class="txt_2">ЛОГИН</p>
                                <div class="message_history_dialog_field_left_rama">
                                    <div class="message_history_dialog_field_left_content">


                                        <div class="txt_2">
                                            КонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтентКонтент


                                        </div>
                                    </div>

                                </div>
                            </div>
                        </div>


                        {{-- @endif
                        @endforeach --}}


                    </div>
                </div>



            </div>


            <div class="message_history_input">

                <div class="message_history_input_search_container">

                    <input type="text" id="" class="message_history_input_container"
                        placeholder="Напишите сообщение...">

                </div>

                <div class="message_history_input_send">

                    <button class="novost_down_func_video" type="submit">Отправить</button>

                </div>

            </div>
        </div>
    </div>

</x-app-layout>
